In [5]:
import pandas as pd
data_frame = pd.read_csv('data/friend_list.csv')
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [8]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [9]:
type(data_frame.name)

pandas.core.series.Series

In [10]:
type(data_frame.age)

pandas.core.series.Series

In [12]:
list_tmp = [1,2,3]
list_tmp

[1, 2, 3]

In [13]:
s1 = pd.core.series.Series( [1,2,3] )
s2 = pd.core.series.Series( ['one','tow','three'] )
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    tow
2    3  three

In [2]:
!conda list | findstr pandas#mac:grep,windows:findstr

pandas                    1.5.3           py311heda8569_0

In [3]:
import pandas as pd

In [5]:
df = pd.read_csv('data/friend_list.csv')

In [6]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [7]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [8]:
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [9]:
df = pd.read_csv('data/friend_list.txt')

In [10]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
df = pd.read_csv('data/friend_list_tab.txt')

In [12]:
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [13]:
df = pd.read_csv('data/friend_list_tab.txt', delimiter = '\t')

In [14]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
df = pd.read_csv('data/friend_list_no_head.csv')

In [16]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [17]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [18]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [19]:
df.columns = ['name','age','job']

In [20]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [21]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name','age','job'])

In [22]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern